Repository: cyrmax/clipManager
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ar

source: Full Clipboard Text
ar: النص الكامل

source: Close
ar: إغلاق

source: Add New Item
ar: إضافة عنصر جديد

source: Enter text:
ar: أدخل النص:

source: Pinned
ar: تثبيت العنصر

source: Save
ar: حفظ

source: Clipboard History
ar: الحافظة

source: Paste
ar: لصق

source: Edit
ar: تعديل

source: Delete
ar: حذف

source: Unpin
ar: إزالة التثبيت

source: Pin
ar: تثبيت

source: View Full Text
ar: عرض النص الكامل

source: Add
ar: إضافة

source: Clear All
ar: حذف جميع العناصر

source: Import history
ar: استيراد ملف الحافظةالحافظة

source: Export history
ar: تصدير سجل الحافظةالحافظة

source: Backup
ar: النسخ الاحتياطي

source: Pasted!
ar: تم اللصق!

source: Cannot paste: Focus is not on an editable text control.
ar: لا يمكن اللصق: التركيز ليس على عنصر قابل للتعديل.

source: Error pasting: {}
ar: خطأ عند محاولة لصق النص.

source: Edit Text
ar: تعديل النص

source: This item cannot be edited because it is not a text.
ar: لا يمكن تحرير هذا العنصر لأنه ليس نصًا.

source: Are you sure you want to delete this item?
ar: هل أنت متأكد أنك تريد حذف هذا العنصر؟

source: Confirm Deletion
ar: تأكيد الحذف

source: Choose a history file to import
ar: اختر ملف الحافظة للاستيراد

source: Importing this history will overwrite your current history. Are you sure you would like to continue?
ar: سيؤدي استيراد هذا السجل إلى استبدال السجل الحالي. هل أنت متأكد أنك ترغب في الاستمرار؟

source: Warning
ar: تحذير

source: History imported successfully.
ar: تم استيراد سجل الحافظة بنجاح.

source: Success
ar: نجاح

source: Invalid history file format.
ar: ملف الحافظة غير صالح.سجل الحافظة فارغ.

source: Error importing history: {}
ar: خطأ في استيراد سجل الحافظة: {}

source: Save history as
ar: حفظ الملف كحفظ سجل الحافظة تلقائيًا عند إغلاق NVDA

source: Your clipboard History has been exported successfully.
ar: لقد تم تصدير سجل الحافظة الخاصة بك بنجاح.

source: Export Success
ar: تم الحفظ

source: Error exporting history: {}
ar: خطأ في تصدير السجل: {}

source: Clipboard History Settings
ar: إعدادات الحافظة

source: History size:
ar: حجم الحافظة:

source: Save history on exit
ar: حفظ سجل الحافظة تلقائيًا عند إغلاق NVDA

source: Save threshold:
ar: تكرار الحفظ كل:

source: Display characters per item:
ar: الحد الأقصى للأحرف لكل عنصر:

source: Show a warning dialog when deleting items
ar: إظهار مربع حوار تحذيري عند حذف العناصر

source: Shows clipboard history
ar: إظهار واجهة الحافظة

source: Clipboard history is empty.
ar: سجل الحافظة فارغ.

source: Failed to get clipboard text: {}
ar: فشل الحصول على النص: {}

source: Error loading clipboard history: Invalid JSON format.
ar: خطأ في تحميل محفوظات الحافظة: تنسيق JSON غير صالح.

source: Error loading clipboard history: {}
ar: خطأ في تحميل سجل الحافظة: {}

source: Error saving clipboard history!
ar: خطأ في حفظ سجل الحافظة!
